{
	"title": "DEEP OC Massive Online Data Streams",
	"summary": "Deep learning for proactive network monitoring and security protection. ",
	"description": [
		"The use case challenges proactive network monitoring for security protection of computing infrastructures [1].",
		"It builds an intelligent module as a machine learning application leveraging deep learning modeling ",
		"to enhance functionality of intrusion detection system supervising network traffic flows.",
		"Preserving historical data, cyber security for such centers can be enhanced in hybrid way [3,4,5] ",
		"using machine learning techniques, especially when large IT infrastructures and devices products ",
		"a huge amount of dataflows continuously and dynamically.\n",
		"",
		"The principle of this deep learning module (as a part of the use case) is proactive time-series forecasting. ",
		"It builds prediction models capable to produce a system behaviour estimation near future. ",
		"The discrepancy between the prediction and the reality gives an indication of anomaly (i.e. anomaly detection).\n",
		"",
		"The challenge of the solution is it aims to scalable edge technologies [4] to support",
		"extensive data analysis and modelling as well as to improve the cyber-resilience in hybrid combination",
		"in real-time with the building intelligence module using neural networks and deep learning.\n",
		"",
		"Deep learning architectures [2] available in this module are: MLP, CNN, autoencoder MLP, ",
		"LSTM, GRU, bidirectional LSTM, sequence to sequence LSTM, stacked LSTM, attention LSTM, TCN, and stackedTCN.\n",
		"",
		"**References**\n",
		"[1]: Nguyen G., Dlugolinsky S., Tran V., Lopez Garcia A.: Deep learning for proactive network monitoring and security protection. IEEE Access, 2020, Volume 8, ISSN 2169-3536, DOI 10.1109/ACCESS.2020.2968718.\n",
		"[2]: Nguyen G., Dlugolinsky S., Bobak M., Tran V., Lopez Garcia A., Heredia I., Malik P., Hluchy L.: Machine Learning and Deep Learning frameworks and libraries for large-scale data mining: a survey. Artificial Intelligence Review, Volume 52, Issue 1, pp. 77-124, ISSN 0269-2821, DOI 10.1007/s10462-018-09679-z. Springer Nature, 2019.\n",
		"[3]: Nguyen G., Nguyen, M., Tran, D. and Hluchy L.: A heuristics approach to mine behavioural data logs in mobile malware detection system. Data & Knowledge Engineering, Volume 115, pp. 129-151, ISSN 0169-023X, DOI 10.1016/j.datak.2018.03.002. Elsevier, 2018.\n",
		"[4]: Bhattacharyya, D.K. and Kalita, J.K., 2013. Network anomaly detection: A machine learning perspective. Chapman and Hall/CRC.\n",
		"[5]: Dua, S. and Du, X., 2016. Data mining and machine learning in cybersecurity. Auerbach Publications.\n"
	],
	"keywords": [
		"services",
		"docker",
		"api-v2",
		"trainable",
		"inference",
		"deep learning",
		"keras",
		"tensorflow"
	],
	"license": "Apache 2.0",
	"date_creation": "2019-02-19",
	"sources": {
		"dockerfile_repo": "https://github.com/deephdc/DEEP-OC-mods",
		"docker_registry_repo": "deephdc/deep-oc-mods",
		"code": "https://github.com/deephdc/mods"
	},
	"continuous_integration": {
		"build_status_badge": "https://jenkins.indigo-datacloud.eu/buildStatus/icon?job=Pipeline-as-code/DEEP-OC-org/DEEP-OC-mods/master",
		"build_status_url": "https://jenkins.indigo-datacloud.eu/job/Pipeline-as-code/job/DEEP-OC-org/job/DEEP-OC-mods/job/master"
	},
	"tosca": [
		{
			"title": "Mesos (CPU/GPU)",
			"url": "https://raw.githubusercontent.com/indigo-dc/tosca-templates/master/deep-oc/deep-oc-marathon-webdav-mods.yml",
			"inputs": [
                                "rclone_conf",
                                "rclone_url",
                                "rclone_vendor",
                                "rclone_user",
                                "rclone_pass"
			]
		}
	]
}
